Repository: mohammed123saleh/EF
Catalog: Main/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Price:
ar: السعر

source: price by Egyptian pound
ar: السعر بالجينه المصرى

source: Prices and sizes
ar: الاسعار والاحجام

source: LE
ar: جينه مصرى

source: For Egypt Only
ar: مصر فقط

source: 6th of October
ar: السادس من أكتوبر

source: Al Sharqia
ar: الشرقية

source: alexandria
ar: الإسكندرية

source: Aswan
ar: أسوان

source: Asyut
ar: أسيوط

source: Beheira
ar: البحيرة

source: Beni Suef
ar: بنى سويف

source: Cairo
ar: القاهرة

source: Dakahlia
ar: الدقهلية

source: Damietta
ar: دمياط

source: Faiyum
ar: الفيوم

source: Gharbia
ar: الغربية

source: Giza
ar: الغربية

source: Ismailia
ar: الإسماعيلية

source: Kafr El Sheikh
ar: كفر الشيخ

source: Luxor
ar: الأقصر

source: Matruh
ar: مطروح

source: Minya
ar: المنيا

source: Monufia
ar: المنوفية

source: New Valley
ar: الوادى الجديد

source: North Sinai
ar: شمال سيناء

source: Port Said
ar: بورسعيد

source: Qalyubia
ar: القليوبية

source: Qena
ar: قنا

source: Red Sea
ar: البحر الأحمر

source: Sharqia
ar: الشرقية

source: Sohag
ar: سوهاج

source: South Sinai
ar: جنوب سيناء

source: Suez
ar: السويس

source: First Name
ar: الإسم الاول

source: Last Name
ar: إسم العائلة

source: Mobile NO
ar: رقم هاتفك المحمول

source: 1234 Main St
ar: إسم الشارع

source: Apartment or suite
ar: رقم الشقة

source: (select country)
ar: برجاء إختيار دولتك

source: Zip code
ar: رقمك البريدى

source: Your Name
ar: إسمك بالكامل

source: Email
ar: الايميل الخاص بك

source: Your Phone
ar: رقم الهاتف

source: Your Message
ar: رسالتك

source: Egypt Fabrics | Sheets | BedSheets
ar: اغطية السرير - إيجيبت فابريكس

source: Buy Now
ar: إشترى الان

source: Previous
ar: السابق

source: (current)
ar: (الحالى)

source: Next
ar: التالى

source: Egypt Fabrics | Products
ar: المنتجات| إيجيبت فابريكس

source: Egypt Fabrics | Contact
ar: تواصل معنا

source: Contact Us
ar: تواصل معنا

source: Submit
ar: سجل

source: Egypt Fabrics
ar: إيجيبت فابريكس

source: Cotton Bath Towels
ar: فوط إستحمام من القطن

source: Add a touch of luxury to your bathroom . Our Towels are made from 100%% Egyptian cotton, the towel has gone through a special combing process to achieve a super soft and absorbent pile.We guarntee a quality towel for the ultimate bath time experience.
ar: أضف لمسة من الفخامة إلى حمامك. المناشف الخاصة بنا مصنوعة من القطن المصري 100٪. تمر المنشفة بعملية تمشيط خاصة لتحقيق نسيج فائق النعومة و الإمتصاص نضمن لكِ منشفة عالية الجودة لتجربة إستحمام لا مثيل لها

source: The Oxford pillow case
ar: غطاء مخدات أكسفورد

source: The Oxford pillow cases set is the Fancy version of the standard pillow case, and is made with an additional fabric border which surrounds all four edges of the standard case.Spoil yourself and order yours now.100%% Sateen Cotton 400TC.
ar: مجموعة أكياس وسائد أكسفورد هي الإصدار الفاخر من كيس الوسادة القياسي مصنوعة بأطراف قماشية إضافية تحيط بالأطراف الأربعة لكيس الوسادة القياسي100% قطن ستانية - 400 عقدة في البوصة دلل نفسك. قم بالطلب الآن

source: Percale Sheets
ar: أغطية بريكال

source: Dreaming about sleeping on five-star hotel-quality sheets? Then you’re thinking about percale sheets 🛏️ Percale are smooth, luxurious & made of breathable 100 %% cotton.
ar: هل تحلم بالنوم على ملاءات عالية الجودة كفنادق الخمس نجوم؟ إذن أنت تفكر في ملاءات البركال البركال الناعم و الفاخر و مصنوع من قطن 100٪ قابل للتنفس

source: Sateen Fitted Sheet Set 400TC
ar: طاقم ملاءات ستانية 400 عقدة في البوصة

source: Sateen sheets are 100 percent cotton sheets with a high thread count and a lustrous sheen. They are woven from combed, carded, or long-fiber cotton threads that are then mercerized, meaning they’re soaked in lye and then in acid. This process not only strengthens the cotton fibers and makes them more durable, but also gives sateen sheets their signature sheen and helps them accept dye evenly.
ar: الملاءات الستانية هي ملاءات قطنية بنسبة مائة في المائة مصنعة من عدد خيوط عالية و لمعان مشرق.يتم نسجها من خيوط قطنية ممشطة أو طويلة الألياف يتم بعد ذلك مما يعني أنها منقوعة في الغسول الخاص بها ثم تنقعبالمحلول الحامض.هذه العملية لا تقوي فقط ألياف القطن وتصنعهاأكثر متانة ، ولكن أيضًا يعطي أوراق الساتين لمعانها المميز ويساعدها على قبول الصبغة بالتساوي.

source: Classic Cotton Duvet Cover 500TC
ar: غطاء لحاف كلاسيكي من القطن 500 عقدة في البوصة

source: A duvet cover is a protective layer that slips over the duvet and has a closure. Because duvets can be expensive and difficult to clean, duvet covers are useful because they protect your duvet or quilt during use and are easily removed and easy to wash.
ar: غطاء اللحاف هو طبقة حماية تنزلق فوق اللحاف ولها مكان للإغلاق.قد تكون الألحفة باهظة الثمن وصعبة التنظيف.الأغطية مفيدة لأنها تحمي لحافك أثناء الاستخدام ويمكن إزالتها بسهولة وغسلها.

source: 100%% Organic Egyptian Cotton
ar: قطن مصرى عضوي %100

source: Shop Now
ar: تسوق الأن

source: 100%% Egyptian Cotton
ar: قطن مصرى %100

source: Popular Categories
ar: المنتجات الأكثر شعبية

source: Best Selling Products
ar: المنتجات الأفضل مبيعاً

source: Pure White Sateen Duvet Set
ar: طقم لحاف ساتين أبيض نقي

source: 100%% Lyocell. Sateen-woven bed linen in lyocell has a pronounced luster, feels soft as silk and is pleasant to sleep in. The decorative embroidery makes the pattern and colors come alive
ar: تتميز بياضات السرير الساتينية المصنوعة من اللايوسل 100% ببريق واضح،ملمس ناعم كالحرير و لطيف للنوم فيه.التطريز المزخرف يجعل النقوش والألوان به تنبض بالحياة

source: Go To Shop
ar: الذهاب إلى التسوق

source: Rest easy with this hemstitch solid color sheet set. Constructed with a cotton sateen weave, this 400 thread count set features a lustrous, lightweight feel. Choose from a variety of rich colors to complement a modern or cottage bedroom vibe.
ar: استرخي مع مجموعة ملاءاتذات الألوان السادة المصنوعة من نسيج الساتين القطنيهذه المجموعة المكونة من 400 خيط تتميز بالراحة و الوزن الخفيف. اختر من بين مجموعة متنوعة من الألوان الغنية لتتناغم مع أجواء غرفة النوم الحديثة

source: Connect Socially
ar: تواصل معنا عبر مواقع التواصل الإجتماعى

source: Egypt Fabrics | Towels
ar: فوط - إيجيبت فابريكس

source: Egypt Fabrics | Petroleum
ar: شركات البترول - إيجيبت فابريكس

source: Egypt Fabrics | Pillowcases
ar: اغطية المخدات - إيجيبت فابريكس

source: Home
ar: الصفحة الرئيسية

source: About
ar: عنا

source: Contact
ar: تواصل معنا

source: Products
ar: منتاجاتنا

source: Varieties
ar: منتاجاتنا المتنوعة

source: Towels
ar: فوط

source: Bedsheet Sets
ar: اطقم اغطية للسرير

source: Pillowcases
ar: اغطية المخدات

source: Petrol
ar: شركات البترول

source: Hospital
ar: مستشفيات

source: Type &amp; Hit Enter..
ar: ابحث

source: Egypt Fabrics | About
ar: عن - إيجيبت فابريكس

source: Our Mission
ar: مهمتنا

source: We focus exclusively on Egyptian coton for a whole bunch of great reasons, But when it comes right down to it, we just love the way our products look and feel. Our products are made with quality materials, high production standards, and ethical manufacturing practices. We’ve met all of our production partners in person and pride ourselves on these relationships with quality manufacturers around the world.
ar: بشكل حصري نركز على القطن المصري لمجموعة كاملة من الأسباب،ولكن عندما يتعلق الأمر بذلك، فإننا نحب الطريقة التي تبدو بها منتجاتنا.منتجاتنا مصنوعة من مواد عالية الجودة و إنتاج عالي المعايير وممارسات التصنيع الأخلاقية. لقد التقينا بكل من شركاء الإنتاج شخصيًا ونفخر بأنفسنا على هذه العلاقات مع الشركات المصنعة عالية الجودة في جميع أنحاء العالم

source: Our Vision
ar: رؤيتنا

source: Egypt Fabrics believes everyone should live in a home they love. Through technology and innovation, Egypt Fabrics makes it possible for shoppers to quickly and easily find exactly what they want from a selection of high quality products. Committed to delighting its customers every step of the way, Egypt Fabrics is reinventing the way people shop for their Homes/Bed rooms - from product discovery to final delivery.
ar: أقمشة ايجيبت فابريكس تؤمن بأن الجميع يجب أن يعيش في منزل يحبونه.من خلال التكنولوجيا والإبتكار، تبدع شركة ايجيبت فابريكس في كل خطوة على الطريق ، تعيد إيجيبت فابريكس ابتكار طريقة تسوق الناس لمنازلهم/لغرف نومهم - من إكتشاف المنتج إلى التسليم النهائي

source: Seed-to-Stitch
ar: من البذرة إلى الحياكة

source: Our sheets are what we call 'seed-to-stitch'. made in the Egypt. The entire manufacturing process and every single part of our product - from growing the cotton, to spinning the yarn, to weaving the fabric, to our military-grade fabrics, recycled packaging, and woven tags - is made here in Egypt.
ar: 'أوراقنا هي ما نسميه 'من البذرة إلى الحياكة. صنع في مصر عملية التصنيع بأكملها وكل جزء من أجزاء المنتج - من زراعة القطن إلى غزل الخيط ونسج النسيج ، للأقمشة ، والتعبئة المعاد تدويرها ، والعلامات المنسوجة صنع هنا في مصر

source: Egypt Fabrics | Shipping Details
ar: بيانات الشحن

source: Shipping Form
ar: نموذج الشحن

source: Shipping Details
ar: بيانات الشحن

source: Email(optional)
ar: بريدك الالكترونى - إختيارى

source: Mobile
ar: رقم هاتفك المحمول

source: Street
ar: الشارع

source: Apartment
ar: شقة

source: Country
ar: دولة

source: Please select a valid country.
ar: برجاء إختيار دولتك

source: Please select a valid zip.
ar: برجاء إختيار رقم بريدي صحيح

source: Governates
ar: المحافظة

source: Please select a valid zip.
ar: برجاء إختيار رقم بريدي صحيح

source: Types In Your Cart
ar: الأنواع فى عربتك

source: Total
ar: الإجمالى

source: Egypt Fabrics | Order Summary
ar: ملخص الاورد الخاص بك | ايجيبت فابريكس

source: Item Title
ar: إسم المنتج

source: Price
ar: السعر

source: Quantity
ar: الكمية

source: Size
ar: المقاس

source: Total Item Price
ar: إجمالى سعر القطع

source: Saving LE
ar: قمت بتوفير

source: Your Cart is Empty
ar: عربتك فارغة

source: Continue Shopping
ar: واصل التسوق

source: Coupon
ar: كوبون

source: -LE
ar: -جم

source: Sub total
ar: الاجمالى الفرعى

source: Taxes
ar: الضرائب

source: Proceed to Checkout
ar: واصل لإتمام الأوردر

source: Add To Cart
ar: أضف إلى السلة

source: RELATED PRODUCTS
ar: منتجات ذات صلة

source: Product Description
ar: وصف المنتج

source: Egypt Fabrics | Thanks
ar: شكرًا جزيلًا | ايجيبت فابريكس

source: Thank You for Your order!
ar: !شكرا جزيلا لاختيارك ايجيبت فابريكس

source: Having trouble?
ar: تواجه صعوبة

source: Contact us
ar: تواصل معنا

source: Continue to homepage
ar: الذهاب إلى الصفحة الرئيسية
